{
  "description": "Privacy Policy for Dynamic Ad Remover Chrome Extension",
  "public": true,
  "files": {
    "privacy-policy.md": {
      "content": "# Privacy Policy for Dynamic Ad Remover\n\n**Last Updated: July 24, 2025**\n\n## Overview\n\nDynamic Ad Remover (\"the Extension\") is committed to protecting your privacy. This Privacy Policy explains how our Chrome extension handles information when you use our service.\n\n## Information We Do NOT Collect\n\nOur extension is designed with privacy as a core principle. We do **NOT** collect, store, transmit, or share:\n\n- Personal information or identifiers\n- Browsing history or website visits\n- Webpage content or URLs\n- User behavior or analytics data\n- Any data about the websites you visit\n- Your IP address or location information\n- Device information or browser fingerprints\n\n## Information Stored Locally\n\nThe Extension stores the following information **locally on your device only**:\n\n### User Configuration Data\n- **CSS Selectors**: The selectors you configure to remove unwanted elements\n- **Excluded Domains**: The list of websites you choose to exclude from ad removal\n- **Extension Settings**: Your preferences for how the extension operates\n\nThis data is stored using Chrome's built-in storage API and remains on your device. It may be synced across your Chrome browsers if you have Chrome sync enabled in your Google account settings.\n\n## How the Extension Works\n\n1. **Local Processing**: All element removal happens locally in your browser\n2. **No External Communication**: The extension does not communicate with any external servers\n3. **User Control**: You have complete control over what elements are targeted and which sites are excluded\n4. **No Tracking**: We do not track your usage or collect analytics\n\n## Permissions Used\n\nThe extension requests the following permissions and here's why:\n\n### Storage Permission\n- **Purpose**: To save your CSS selectors and excluded domains\n- **Scope**: Data is stored locally in your browser only\n- **Access**: Only you can access and modify this data\n\n### Scripting Permission\n- **Purpose**: To inject content scripts that remove unwanted elements\n- **Scope**: Only operates on the CSS selectors you configure\n- **Process**: All processing happens locally on each webpage\n\n### Host Permissions (All URLs)\n- **Purpose**: To allow the extension to work on any website you choose\n- **Limitation**: Only acts on websites not in your exclusion list\n- **Control**: You can exclude any domain from the extension's functionality\n\n## Data Security\n\n- **Local Storage**: All data remains on your device\n- **No Transmission**: No data is sent to external servers\n- **Browser Security**: Protected by Chrome's built-in security features\n- **User Control**: You can delete all extension data by removing the extension\n\n## Third-Party Services\n\nThe Extension does not integrate with, communicate with, or share data with any third-party services, analytics platforms, or external APIs.\n\n## Chrome Web Store Compliance\n\nThis extension complies with the Chrome Web Store Developer Program Policies:\n\n- **Single Purpose**: Removes unwanted webpage elements via CSS selectors\n- **Limited Use**: Only uses permissions necessary for core functionality\n- **No Data Mining**: Does not collect or transmit user data\n- **Transparent**: All functionality is clearly described\n\n## Your Rights and Controls\n\nYou have complete control over the extension:\n\n- **Configuration**: Add, modify, or remove CSS selectors and excluded domains\n- **Data Deletion**: Uninstalling the extension removes all stored data\n- **Selective Usage**: Use domain exclusions to control where the extension operates\n- **No Account Required**: No sign-up, login, or personal information needed\n\n## Children's Privacy\n\nThe Extension does not knowingly collect information from children under 13 years of age. Since we don't collect any personal information, the extension is safe for users of all ages.\n\n## Changes to This Privacy Policy\n\nWe may update this Privacy Policy from time to time. Any changes will be reflected in the \"Last Updated\" date at the top of this policy. Continued use of the extension after changes constitutes acceptance of the updated policy.\n\n## Open Source\n\nThis extension is open source. You can review the complete source code at:\nhttps://github.com/guberm/dynamic-ad-remover-extension\n\nThe source code transparency allows you to verify our privacy claims.\n\n## Contact Information\n\nIf you have questions about this Privacy Policy or the extension's privacy practices:\n\n- **GitHub Repository**: https://github.com/guberm/dynamic-ad-remover-extension\n- **Issues**: Report concerns via GitHub Issues\n- **Developer**: guberm\n\n## Technical Implementation\n\nFor transparency, here's how privacy is technically implemented:\n\n### Data Flow\n1. User configures selectors and exclusions\n2. Data is stored locally using `chrome.storage.sync`\n3. Content script reads local data\n4. Elements are removed based on local configuration\n5. No data leaves the browser\n\n### Code Verification\nYou can verify our privacy claims by examining:\n- `manifest.json` - See all requested permissions\n- `content.js` - See how element removal works\n- `popup.js` - See how settings are stored and retrieved\n- `background.js` - See background script functionality (minimal)\n\n## Summary\n\nDynamic Ad Remover is designed to respect your privacy completely:\n- ✅ No data collection\n- ✅ No external communication\n- ✅ Local processing only\n- ✅ User-controlled configuration\n- ✅ Open source code\n- ✅ No tracking or analytics\n\nYour browsing habits, personal information, and website visits remain completely private."
    }
  }
}
